app/views/messages/_show_messages.html.erb

    - <%= message.user.name %>
    - <%= message.created_at %>
---
INSERT INTO "messages" ("body", "user_id", "conversation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "awerwerwe"], ["user_id", 1], ["conversation_id", 1], ["created_at", "2015-12-14 19:31:08.355307"], ["updated_at", "2015-12-14 19:31:08.355307"]]