AccountaBuddy/app/controllers/accountabuddy_requests_controller.rb

  def create
    p "*" * 60
    p params
    @recipient_id = params[:recipient][:recipient_id].to_i
    @friendship_id = params[:recipient][:friendship_id].to_i
    @accountabuddy_request = AccountabuddyRequest.new(user_id: current_user.id, recipient_id: @recipient_id, friendship_id: @friendship_id)
    if @accountabuddy_request.save
---
INSERT INTO "accountabuddy_requests" ("user_id", "recipient_id", "friendship_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["recipient_id", 14], ["friendship_id", 49], ["created_at", "2015-12-14 20:12:50.249079"], ["updated_at", "2015-12-14 20:12:50.249079"]]