AccountaBuddy/app/controllers/friendships_controller.rb

  def show
    @friendship = Friendship.find(params[:id])

    @conversation = Conversation.find_by(sender_id: @friendship.user_id, recipient_id: @friendship.friend_id ) || Conversation.find_by(recipient_id: @friendship.user_id, sender_id: @friendship.friend_id)
    p "*" * 60
    p @conversation
    # @message =Message.new
    @friend = User.find(@friendship.friend_id)
    if @conversation && @conversation.messages
      @messages = @conversation.messages.order("created_at ASC")
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", 47]]
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."sender_id" = $1 AND "conversations"."recipient_id" = $2 LIMIT 1  [["sender_id", 1], ["recipient_id", 13]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 13]]
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  ORDER BY created_at ASC  [["conversation_id", 1]]

  def update
    p params
      @friendship = Friendship.find(params[:id])
  		@friendship.update(accountabuddy: true)
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", 49]]
UPDATE "friendships" SET "accountabuddy" = $1, "updated_at" = $2 WHERE "friendships"."id" = $3  [["accountabuddy", "t"], ["updated_at", "2015-12-14 20:30:18.110219"], ["id", 49]]