AccountaBuddy/app/controllers/friend_requests_controller.rb

  def create
    p params
    @friend_request = FriendRequest.new(user_id: current_user.id, recipient_id: params[:recipientid][:recipient_id])
    if @friend_request.save
---
INSERT INTO "friend_requests" ("user_id", "recipient_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 13], ["recipient_id", 1], ["category_id", 1], ["created_at", "2015-12-14 19:03:44.620377"], ["updated_at", "2015-12-14 19:03:44.620377"]]

  def update
    @friend_request = FriendRequest.find(params[:id])
    @friend_request.update(friends: true)
    @friendship = Friendship.new(user_id: current_user.id, friend_id: @friend_request.user_id)
    @inverse_friendship = Friendship.new(user_id: @friend_request.user_id, friend_id: current_user.id)
    Conversation.create(sender_id:current_user.id, recipient_id: @friend_request.user_id )
---
SELECT  "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "friend_requests" SET "friends" = $1, "updated_at" = $2 WHERE "friend_requests"."id" = $3  [["friends", "t"], ["updated_at", "2015-12-14 19:04:25.091019"], ["id", 1]]
INSERT INTO "conversations" ("sender_id", "recipient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sender_id", 1], ["recipient_id", 13], ["created_at", "2015-12-14 19:04:25.113362"], ["updated_at", "2015-12-14 19:04:25.113362"]]
INSERT INTO "friendships" ("user_id", "friend_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["friend_id", 13], ["category_id", 1], ["created_at", "2015-12-14 19:04:25.106601"], ["updated_at", "2015-12-14 19:04:25.106601"]]