AccountaBuddy/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "email", "password_digest", "about_me", "gender", "birthdate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "badges" ("name", "description", "user_id", "badge_image_link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    # @badge1 = Badge.new(name: "Fitness", description: "You're a fitness superstar!", user_id: @user.id)
    # @badge2 = Badge.new(name: "Diet", description: "You're a Diet superstar!", user_id: @user.id)
    # @badge3 = Badge.new(name: "Hobbies", description: "You're a Hobbies superstar!", user_id: @user.id)
    # @badge4 = Badge.new(name: "Education", description: "You're a Education superstar!", user_id: @user.id)
    if @user.save
      @badge1 = Badge.new(name: "Fitness", description: "You're a fitness superstar!", user_id: @user.id, badge_image_link: "fitness-badge.png")
      @badge2 = Badge.new(name: "Diet", description: "You're a Diet superstar!", user_id: @user.id, badge_image_link:"diet-badge.png")
      @badge3 = Badge.new(name: "Hobbies", description: "You're a Hobbies superstar!", user_id: @user.id, badge_image_link:"hobbies-badge.png")
      @badge4 = Badge.new(name: "Education", description: "You're a Education superstar!", user_id: @user.id, badge_image_link:"education-badge.png")
        if @badge1.save && @badge2.save && @badge3.save && @badge4.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 13]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."accountabuddy" = $2  [["user_id", 13], ["accountabuddy", "t"]]
SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."recipient_id" = $1 AND "friend_requests"."friends" = $2  [["recipient_id", 13], ["friends", "f"]]
SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."user_id" = $1 AND "friend_requests"."friends" = $2  [["user_id", 13], ["friends", "f"]]
SELECT "badges".* FROM "badges" WHERE "badges"."user_id" = $1  [["user_id", 13]]
---
  def show
    @user = User.find(params[:id])
    @accountabuddies = @user.friendships.where(accountabuddy:true)
    @just_friends= @user.friendships.where(accountabuddy:false)
    @friend_requests = FriendRequest.where(recipient_id: @user.id, friends: false)
    @pending_requests = FriendRequest.where(user_id: @user.id, friends:false)
    @badges = @user.badges
    @friendship = Friendship.find_by(user_id: current_user.id , friend_id: @user.id)