app/controllers/accountabuddy_requests_controller.rb

  def create
    p "*" * 60
    p params
    @recipient_id = params[:recipient][:recipient_id].to_i
    @friendship_id = params[:recipient][:friendship_id].to_i
    @accountabuddy_request = AccountabuddyRequest.new(user_id: current_user.id, recipient_id: @recipient_id, friendship_id: @friendship_id)
    if @accountabuddy_request.save
---
INSERT INTO "accountabuddy_requests" ("user_id", "recipient_id", "friendship_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 14], ["recipient_id", 14], ["friendship_id", 47], ["created_at", "2015-12-15 02:44:47.086810"], ["updated_at", "2015-12-15 02:44:47.086810"]]

  def update
    p params
    @accountabuddy_request = AccountabuddyRequest.find(params[:id])
    p @accountabuddy_request
    @friendship_id = @accountabuddy_request.friendship_id
    @friendship = Friendship.find(@friendship_id)
    @friendship.update(accountabuddy: true)
---
SELECT  "accountabuddy_requests".* FROM "accountabuddy_requests" WHERE "accountabuddy_requests"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", 47]]
UPDATE "friendships" SET "accountabuddy" = $1, "updated_at" = $2 WHERE "friendships"."id" = $3  [["accountabuddy", "t"], ["updated_at", "2015-12-15 02:50:38.152518"], ["id", 47]]