app/controllers/badges_controller.rb

SELECT  "badges".* FROM "badges" WHERE "badges"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "badges" SET "points" = $1, "updated_at" = $2 WHERE "badges"."id" = $3  [["points", 1], ["updated_at", "2015-12-15 02:51:45.819660"], ["id", 5]]
---
  def update
      p params
      badge = Badge.find(params[:id])
      badge.update(points: badge.points.to_i + 1 )