app/controllers/categories_controller.rb

SELECT  "user_categories".* FROM "user_categories" WHERE "user_categories"."user_id" = $1 AND "user_categories"."category_id" = $2 LIMIT 1  [["user_id", 14], ["category_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 14]]
SELECT  "user_categories".* FROM "user_categories" WHERE "user_categories"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  1 AS one FROM "user_categories" WHERE "user_categories"."user_id" = $1 AND "user_categories"."category_id" = $2 LIMIT 1  [["user_id", 14], ["category_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "user_categories" ON "users"."id" = "user_categories"."user_id" WHERE "user_categories"."category_id" = $1  [["category_id", 1]]
---
  def show
    @user_categories = UserCategory.all
    @user = User.find(params[:id])
    @category = Category.find(params[:id])
    @users_in_category = @category.users
    if UserCategory.exists?(user_id: current_user.id, category_id: @category.id)