app/controllers/friendships_controller.rb

  def show
    @friendship = Friendship.find(params[:id])

    @conversation = Conversation.find_by(sender_id: @friendship.user_id, recipient_id: @friendship.friend_id ) || Conversation.find_by(recipient_id: @friendship.user_id, sender_id: @friendship.friend_id)
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", 47]]
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."sender_id" = $1 AND "conversations"."recipient_id" = $2 LIMIT 1  [["sender_id", 13], ["recipient_id", 14]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 14]]

  def update
      @friendship = Friendship.find(params[:id])
      @friend_id = @friendship.user_id
      @inverse_friendship = Friendship.find(friend_id: @friend_id)
      @inverse_friendship.update(accountabuddy: true)
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", 48]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 14]]
UPDATE "friendships" SET "accountabuddy" = $1, "updated_at" = $2 WHERE "friendships"."id" = $3  [["accountabuddy", "t"], ["updated_at", "2015-12-14 23:31:49.456824"], ["id", 48]]