app/controllers/sessions_controller.rb

  def create
    if request.env['omniauth.auth']
      puts request.env['omniauth.auth'].to_yaml
      @user = User.create_with_omniauth(request.env['omniauth.auth'])
      session[:user_id] = @user.id
      if @user.latitude == nil
        redirect_to edit_user_path(@user.id)
      else
        redirect_to user_path(@user.id)
      end
    else
      @user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "user2"]]