app/controllers/user_categories_controller.rb

INSERT INTO "user_categories" ("user_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 14], ["category_id", 1], ["created_at", "2015-12-15 04:03:17.737509"], ["updated_at", "2015-12-15 04:03:17.737509"]]
---
  def create
    @user_category = UserCategory.new(user_id: params[:category][:user_id], category_id: params[:category][:category_id])
    if @user_category.save